examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider3_B.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39838808[ label="{Model|}"]

39967464[ label="{ID|}"]

39950040[ label="{STRING|}"]

39848456[ label="{BOOL|}"]

39615784[ label="{INT|}"]

39855192[ label="{FLOAT|}"]

39597128[ label="{STRICTFLOAT|}"]

39589208[ label="{NUMBER|}"]

39604984[ label="{BASETYPE|}"]

40442120[ label="{*OBJECT|}"]

40604984[ label="{Cls|+name:ID\l}"]

39607480[ label="{Method|+name:ID\l}"]

39594744[ label="{Obj|+name:ID\l}"]

40597976[ label="{Call|+name:ID\l}"]

39621656[ label="{Import|+importURI:STRING\l}"]

39587208[ label="{Comment|\\/\\/.*}"]



39838808 -> 39621656[arrowtail=diamond, dir=both, headlabel="imports 1..*"]
39838808 -> 40604984[arrowtail=diamond, dir=both, headlabel="cls 1..*"]
39838808 -> 39594744[arrowtail=diamond, dir=both, headlabel="obj 1..*"]
39838808 -> 40597976[arrowtail=diamond, dir=both, headlabel="call 1..*"]
39589208 -> 39597128 [dir=back]
39589208 -> 39615784 [dir=back]
39604984 -> 39589208 [dir=back]
39604984 -> 39855192 [dir=back]
39604984 -> 39848456 [dir=back]
39604984 -> 39967464 [dir=back]
39604984 -> 39950040 [dir=back]
40442120 -> 39604984 [dir=back]
40604984 -> 40604984[headlabel="extends 1..*"]
40604984 -> 39607480[arrowtail=diamond, dir=both, headlabel="methods 1..*"]
39594744 -> 40604984[headlabel="ref "]
40597976 -> 39594744[headlabel="obj "]
40597976 -> 39607480[headlabel="method "]

}
